"""Compute manuscript analysis.
"""

import re
import json
import pandas as pd
from loguru import logger
from greek_accentuation.characters import *


def expand_nomina_sacra(text):
    # Remove all accents
    text = "".join([base(letter) for letter in text]).lower()
    # Dictionary mapping nomina sacra to their expanded forms
    nomina_sacra_dict = {
        # Nominative forms
        'θς': 'θεος', 'κς': 'κυριος', 'ἰησ': 'ιησους', 'δαυ': 'δαυιδ', 'ισ': 'ιησους',
        'πνα': 'πνευμα', 'ισρλ': 'ισραηλ', 'χσ': 'χριστος', 'ισαακ': 'ισαακ','ισλ': 'ισραηλ','ἰσ': 'ιησους',
        # Genitive forms
        'θυ': 'θεου', 'κυ': 'κυριου', 'ἰησ': 'ιησου', 'δαυ': 'δαυιδ',
        'πνυ': 'πνευματοσ', 'ισρλ': 'ισραηλ', 'χυ': 'χριστου', 'ισαακ': 'ισαακ', 'ουνου': 'ουρανου',
        'ιυ': 'ιησου',  # Additional form for Jesus
        # Accusative forms
        'θν': 'θεον', 'κν': 'κυριον', 'ἰησ': 'ιεσουν', 'δαυ': 'δαυιδ',
        'πνα': 'πνευμα', 'ισρλ': 'ισραηλ', 'χν': 'χριστον', 'ισαακ': 'ισαακ',
        'ιυ': 'ιησσουν',  # Additional form for Jesus
        # Dative forms
        'θω': 'θεω', 'κω': 'κυριω', 'ἰησ': 'ιησου', 'δαυ': 'δαυιδ',
        'πνα': 'πνευματι', 'ισρλ': 'ισραηλ', 'χω': 'χριστω', 'ισαακ': 'ισαακ', 'ανων': 'ανδροπον',
        'ιυ': 'ιησου',  # Additional form for Jesus
        # Vocative forms
        'κε': 'κυριε'
    }

    # Regular expression pattern to match nomina sacra
    pattern = r'\b(' + '|'.join(re.escape(ns)
                                for ns in nomina_sacra_dict.keys()) + r')\b'

    # Function to replace nomina sacra with their expanded forms
    def replace_nomina_sacra(match):
        return nomina_sacra_dict[match.group(0)]

    # Perform the replacement
    return re.sub(pattern, replace_nomina_sacra, text).replace("ς","σ") # Replace all endings with s


def evaluate_manuscript_readings(manuscript: dict[str, any], rule: pd.DataFrame):
    """Evaluate a given manuscript.
    """
    readings = {}
    for profile in rule.iterrows():

        try:
            content = expand_nomina_sacra(
                manuscript[str(profile[1]["chapter"])][str(profile[1]["verse"])])
            reading = expand_nomina_sacra(str(profile[1]["reading"]))
            alternative_reading = expand_nomina_sacra(str(profile[1]["alternative_reading"]))
            # Check which one is longer and start with the longer one
            if len(reading) >= len(alternative_reading):
                if re.search(reading, content):
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = reading
                elif ("omit" in reading) and (not re.search(alternative_reading, content)):
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = ""
                elif re.search(alternative_reading, content):
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = alternative_reading
                else:
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = content
            else:
                if re.search(alternative_reading, content):
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = alternative_reading
                elif ("omit" in reading):
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = ""
                elif re.search(reading, content):
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = reading
                else:
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = content
        except KeyError:
            readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = -1
    return pd.DataFrame.from_dict(readings, orient="index")


def evaluate_manuscript_silhouette(manuscript: dict[str, any], rule: pd.DataFrame):
    """Evaluate a given manuscript.
    """
    readings = {}
    for profile in rule.iterrows():
        try:
            content = expand_nomina_sacra(
                manuscript[str(profile[1]["chapter"])][str(profile[1]["verse"])])
            reading = expand_nomina_sacra(str(profile[1]["reading"]))
            alternative_reading = expand_nomina_sacra(str(profile[1]["alternative_reading"]))
            # Check which one is longer and start with the longer one
            if len(reading) >= len(alternative_reading):
                if re.search(reading, content):
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = 1
                elif ("omit" in reading) and (not re.search(alternative_reading, content)):
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = 1
                else:
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = 0
            else:
                if re.search(alternative_reading, content):
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = 0
                elif ("omit" in reading):
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = 1
                elif re.search(reading, content):
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = 1
                else:
                    readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = 0
        except KeyError:
            readings[f'{profile[1]["chapter"]}:{profile[1]["reading_id"]}'] = -1
    return pd.DataFrame.from_dict(readings, orient="index")


if __name__ == "__main__":
    with open("data/manuscripts.json") as f:
        manuscripts = json.load(f)

    manuscripts["Es"] = tr = {
        "1":
        {
            "1": "επειδηπερ πολλοι επεχειρησαν αναταξασθαι διηγησιν περι των πεπληροφορημενων εν ημιν πραγματων",
            "2": "καθως παρεδοσαν ημιν οι απ αρχης αυτοπται και υπηρεται γενομενοι του λογου",
            "3": "εδοξεν καμοι παρηκολουθηκοτι ανωθεν πασιν ακριβως καθεξης σοι γραψαι κρατιστε θεοφιλε",
            "4": "ινα επιγνως περι ων κατηχηθης λογων την ασφαλειαν",
            "5": "εγενετο εν ταις ημεραις ηρωδου του βασιλεως της ιουδαιας ιερευς τις ονοματι ζαχαριας εξ εφημεριας αβια και η γυνη αυτου εκ των θυγατερων ααρων και το ονομα αυτης ελισαβετ",
            "6": "ησαν δε δικαιοι αμφοτεροι ενωπιον του θεου πορευομενοι εν πασαις ταις εντολαις και δικαιωμασιν του κυριου αμεμπτοι",
            "7": "και ουκ ην αυτοις τεκνον καθοτι η ελισαβετ ην στειρα και αμφοτεροι προβεβηκοτες εν ταις ημεραις αυτων ησαν",
            "8": "εγενετο δε εν τω ιερατευειν αυτον εν τη ταξει της εφημεριας αυτου εναντι του θεου",
            "9": "κατα το εθος της ιερατειας ελαχεν του θυμιασαι εισελθων εις τον ναον του κυριου",
            "10": "και παν το πληθος του λαου ην προσευχομενον εξω τη ωρα του θυμιαματος",
            "11": "ωφθη δε αυτω αγγελος κυριου εστως εκ δεξιων του θυσιαστηριου του θυμιαματος",
            "12": "και εταραχθη ζαχαριας ιδων και φοβος επεπεσεν επ αυτον",
            "13": "ειπεν δε προς αυτον ο αγγελος μη φοβου ζαχαρια διοτι εισηκουσθη η δεησις σου και η γυνη σου ελισαβετ γεννησει υιον σοι και καλεσεις το ονομα αυτου ιωαννην",
            "14": "και εσται χαρα σοι και αγαλλιασις και πολλοι επι τη γεννησει αυτου χαρησονται",
            "15": "εσται γαρ μεγας ενωπιον του κυριου και οινον και σικερα ου μη πιη και πνευματος αγιου πλησθησεται ετι εκ κοιλιας μητρος αυτου",
            "16": "και πολλους των υιων ισραηλ επιστρεψει επι κυριον τον θεον αυτων",
            "17": "και αυτος προελευσεται ενωπιον αυτου εν πνευματι και δυναμει ηλιου επιστρεψαι καρδιας πατερων επι τεκνα και απειθεις εν φρονησει δικαιων ετοιμασαι κυριω λαον κατεσκευασμενον",
            "18": "και ειπεν ζαχαριας προς τον αγγελον κατα τι γνωσομαι τουτο εγω γαρ ειμι πρεσβυτης και η γυνη μου προβεβηκυια εν ταις ημεραις αυτης",
            "19": "και αποκριθεις ο αγγελος ειπεν αυτω εγω ειμι γαβριηλ ο παρεστηκως ενωπιον του θεου και απεσταλην λαλησαι προς σε και ευαγγελισασθαι σοι ταυτα",
            "20": "και ιδου εση σιωπων και μη δυναμενος λαλησαι αχρι ης ημερας γενηται ταυτα ανθ ων ουκ επιστευσας τοις λογοις μου οιτινες πληρωθησονται εις τον καιρον αυτων",
            "21": "και ην ο λαος προσδοκων τον ζαχαριαν και εθαυμαζον εν τω χρονιζειν αυτον εν τω ναω",
            "22": "εξελθων δε ουκ ηδυνατο λαλησαι αυτοις και επεγνωσαν οτι οπτασιαν εωρακεν εν τω ναω και αυτος ην διανευων αυτοις και διεμενεν κωφος",
            "23": "και εγενετο ως επλησθησαν αι ημεραι της λειτουργιας αυτου απηλθεν εις τον οικον αυτου",
            "24": "μετα δε ταυτας τας ημερας συνελαβεν ελισαβετ η γυνη αυτου και περιεκρυβεν εαυτην μηνας πεντε λεγουσα",
            "25": "οτι ουτως μοι πεποιηκεν ο κυριος εν ημεραις αις επειδεν αφελειν το ονειδος μου εν ανθρωποις",
            "26": "εν δε τω μηνι τω εκτω απεσταλη ο αγγελος γαβριηλ υπο του θεου εις πολιν της γαλιλαιας η ονομα ναζαρετ",
            "27": "προς παρθενον μεμνηστευμενην ανδρι ω ονομα ιωσηφ εξ οικου δαβιδ και το ονομα της παρθενου μαριαμ",
            "28": "και εισελθων ο αγγελος προς αυτην ειπεν χαιρε κεχαριτωμενη ο κυριος μετα σου ευλογημενη συ εν γυναιξιν",
            "29": "η δε ιδουσα διεταραχθη επι τω λογω αυτου και διελογιζετο ποταπος ειη ο ασπασμος ουτος",
            "30": "και ειπεν ο αγγελος αυτη μη φοβου μαριαμ ευρες γαρ χαριν παρα τω θεω",
            "31": "Καὶ ἰδοὺ συλλήψῃ ἐν γαστρὶ καὶ τέξῃ υἱὸν καὶ καλέσεις τὸ ὄνομα αὐτοῦ Ἰησοῦν.",
            "32": "Οὗτος ἔσται μέγας καὶ υἱὸς Ὑψίστου κληθήσεται, καὶ δώσει αὐτῷ Κύριος ὁ Θεὸς τὸν θρόνον Δαυὶδ τοῦ πατρὸς αὐτοῦ.",
            "33": "Καὶ βασιλεύσει ἐπὶ τὸν οἶκον Ἰακὼβ εἰς τοὺς αἰῶνας, καὶ τῆς βασιλείας αὐτοῦ οὐκ ἔσται τέλος.",
            "34": "Εἶπεν δὲ Μαριὰμ πρὸς τὸν ἄγγελον· Πῶς ἔσται τοῦτο, ἐπεὶ ἄνδρα οὐ γινώσκω;",
            "35": "Καὶ ἀποκριθεὶς ὁ ἄγγελος εἶπεν αὐτῇ· Πνεῦμα Ἅγιον ἐπελεύσεται ἐπὶ σέ, καὶ δύναμις Ὑψίστου ἐπισκιάσει σοι· διὸ καὶ τὸ γεννώμενον ἅγιον κληθήσεται Υἱὸς Θεοῦ.",
            "36": "Καὶ ἰδοὺ Ἐλισάβετ ἡ συγγενίς σου καὶ αὐτὴ συνείληφυς υἱὸν ἐν γήρει αὐτῆς, καὶ οὗτος μὴν ἕκτος ἐστὶν αὐτῇ τῇ καλουμένῃ στείρᾳ·",
            "37": "ὅτι οὐκ ἀδυνατήσει παρὰ τῷ Θεῷ πᾶν ῥῆμα.",
            "38": "Εἶπεν δὲ Μαριὰμ· Ἰδοὺ ἡ δούλη Κυρίου· γένοιτό μοι κατὰ τὸ ῥῆμά σου. Καὶ ἀπῆλθεν ἀπ' αὐτῆς ὁ ἄγγελος.",
            "39": "Ἀναστᾶσα δὲ Μαριὰμ ἐν ταῖς ἡμέραις ταύταις ἐπορεύθη εἰς τὴν ὀρεινὴν μετὰ σπουδῆς εἰς πόλιν Ἰούδα,",
            "40": "καὶ εἰσῆλθεν εἰς τὸν οἶκον Ζαχαρίου καὶ ἠσπάσατο τὴν Ἐλισάβετ.",
            "41": "Καὶ ἐγένετο ὡς ἤκουσεν ἡ Ἐλισάβετ τὸν ἀσπασμὸν τῆς Μαρίας, ἐσκίρτησεν τὸ βρέφος ἐν τῇ κοιλίᾳ αὐτῆς, καὶ ἐπλήσθη Πνεύματος Ἁγίου ἡ Ἐλισάβετ",
            "42": "καὶ ἀνεφώνησεν φωνῇ μεγάλῃ καὶ εἶπεν· Εὐλογημένη σὺ ἐν γυναιξίν, καὶ εὐλογημένος ὁ καρπὸς τῆς κοιλίας σου.",
            "43": "καὶ πόθεν μοι τοῦτο ἵνα ἔλθῃ ἡ μήτηρ τοῦ Κυρίου μου πρὸς με;",
            "44": "ἰδοὺ γὰρ ὡς ἐγένετο ἡ φωνὴ τοῦ ἀσπασμοῦ σου εἰς τὰ ὦτά μου, ἐσκίρτησεν ἐν ἀγαλλιάσει τὸ βρέφος ἐν τῇ κοιλίᾳ μου.",
            "45": "καὶ μακαρία ἡ πιστεύσασα ὅτι ἔσται τελείωσις τῶν λελαλημένων αὐτῇ παρὰ Κυρίου.",
            "46": "Καὶ εἶπεν Μαριὰμ· Μεγαλύνει ἡ ψυχή μου τὸν Κύριον,",
            "47": "καὶ ἠγαλλίασεν τὸ πνεῦμά μου ἐπὶ τῷ Θεῷ τῷ σωτῆρί μου,",
            "48": "ὅτι ἐπέβλεψεν ἐπὶ τὴν ταπείνωσιν τῆς δούλης αὐτοῦ. ἰδοὺ γὰρ ἀπὸ τοῦ νῦν μακαριοῦσίν με πᾶσαι αἱ γενεαί,",
            "49": "ὅτι ἐποίησέν μοι μεγάλα ὁ Δυνατός, καὶ ἅγιον τὸ ὄνομα αὐτοῦ.",
            "50": "καὶ τὸ ἔλεος αὐτοῦ εἰς γενεὰς καὶ γενεὰς τοῖς φοβουμένοις αὐτόν.",
            "51": "Ἐποίησεν κράτος ἐν βραχίονι αὐτοῦ, διεσκόρπισεν ὑπερηφάνους διανοίᾳ καρδίας αὐτῶν.",
            "52": "καθεῖλεν δυνάστας ἀπὸ θρόνων καὶ ὕψωσεν ταπεινούς.",
            "53": "πεινῶντας ἐνέπλησεν ἀγαθῶν καὶ πλουτοῦντας ἐξαπέστειλεν κενούς.",
            "54": "Ἀντελάβετο Ἰσραὴλ παιδὸς αὐτοῦ, μνησθῆναι ἐλέους",
            "55": "καθὼς ἐλάλησεν πρὸς τοὺς πατέρας ἡμῶν τῷ Ἀβραὰμ καὶ τῷ σπέρματι αὐτοῦ εἰς τὸν αἰῶνα.",
            "56": "Ἐμείνεν δὲ Μαριὰμ σὺν αὐτῇ ὡσεὶ μῆνας τρεῖς, καὶ ὑπέστρεψεν εἰς τὸν οἶκον αὐτῆς.",
            "57": "Τῇ δὲ Ἐλισάβετ ἐπλήσθη ὁ χρόνος τοῦ τεκεῖν αὐτὴν καὶ ἐγέννησεν υἱόν.",
            "58": "Καὶ ἤκουσαν οἱ περίοικοι καὶ οἱ συγγενεῖς αὐτῆς ὅτι ἐμεγάλυνεν Κύριος τὸ ἔλεος αὐτοῦ μετ' αὐτῆς, καὶ συνεχάρησαν αὐτῇ.",
            "59": "Καὶ ἐγένετο ἐν τῇ ὀγδόῃ ἡμέρᾳ ἦλθον περιτεμεῖν τὸ παιδίον, καὶ ἐκάλουν αὐτὸ ἐπὶ τῷ ὀνόματι τοῦ πατρὸς αὐτοῦ Ζαχαρίαν.",
            "60": "καὶ ἀποκριθεῖσα ἡ μήτηρ αὐτοῦ εἶπεν· Οὐχί, ἀλλὰ κληθήσεται Ἰωάννης.",
            "61": "Καὶ εἶπαν πρὸς αὐτήν· Ὅτι οὐδεὶς ἐστὶν ἐν τῇ συγγενείᾳ σου ὃς καλεῖται τῷ ὀνόματι τούτῳ.",
            "62": "Ἐνένευον δὲ τῷ πατρὶ αὐτοῦ τί ἂν θέλοι καλεῖσθαι αὐτόν.",
            "63": "καὶ αἰτήσας πινακίδιον ἔγραψεν λέγων· Ἰωάννης ἐστὶ τὸ ὄνομα αὐτοῦ, καὶ ἐθαύμασαν πάντες.",
            "64": "Ἀνεῴχθη δὲ τὸ στόμα αὐτοῦ παραχρῆμα καὶ ἡ γλῶσσα αὐτοῦ καὶ ἐλάλει εὐλογῶν τὸν Θεόν.",
            "65": "καὶ ἐγένετο ἐπὶ πάντας φόβος τοὺς περιοικοῦντας αὐτούς· καὶ ἐν ὅλῃ τῇ ὀρεινῇ τῆς Ἰουδαίας διελαλεῖτο πάντα τὰ ῥήματα ταῦτα.",
            "66": "Καὶ ἐθέντο πάντες οἱ ἀκούσαντες ἐν τῇ καρδίᾳ αὐτῶν λέγοντες· Τί ἄρα τὸ παιδίον τοῦτο ἔσται; καὶ χεὶρ Κυρίου ἦν μετ' αὐτοῦ.",
            "67": "Καὶ Ζαχαρίας ὁ πατὴρ αὐτοῦ ἐπλήσθη Πνεύματος Ἁγίου καὶ προεφήτευσεν λέγων·",
            "68": "Εὐλογητὸς Κύριος ὁ Θεὸς τοῦ Ἰσραήλ, ὅτι ἐπεσκέψατο καὶ ἐποίησεν λύτρωσιν τῷ λαῷ αὐτοῦ",
            "69": "καὶ ἤγειρεν κέρας σωτηρίας ἡμῖν ἐν οἴκῳ Δαυὶδ παιδὸς αὐτοῦ",
            "70": "καθὼς ἐλάλησεν διὰ στόματος τῶν ἁγίων ἀπ' αἰῶνος προφητῶν αὐτοῦ,",
            "71": "σωτηρίαν ἐξ ἐχθρῶν ἡμῶν καὶ ἐκ χειρὸς πάντων τῶν μισούντων ἡμᾶς,",
            "72": "ποιῆσαι ἔλεος μετὰ τῶν πατέρων ἡμῶν καὶ μνησθῆναι διαθήκης ἁγίας αὐτοῦ,",
            "73": "ὅρκον ὃν ὤμοσεν πρὸς Ἀβραὰμ τὸν πατέρα ἡμῶν",
            "74": "τοῦ δοῦναι ἡμῖν ἀφόβως ἐκ χειρὸς ἐχθρῶν ῥυσθέντας",
            "75": "λατρεύειν αὐτῷ ἐν ὁσιότητι καὶ δικαιοσύνῃ ἐνώπιον αὐτοῦ πάσας τὰς ἡμέρας ἡμῶν.",
            "76": "Καὶ σὺ, παιδίον, προφήτης ὑψίστου κληθήσῃ, προπορεύσῃ γὰρ ἐνώπιον Κυρίου ἑτοιμάσαι ὁδοὺς αὐτοῦ",
            "77": "τοῦ δοῦναι γνῶσιν σωτηρίας τῷ λαῷ αὐτοῦ ἐν ἀφέσει ἁμαρτιῶν αὐτῶν",
            "78": "διὰ σπλάγχνα ἐλέους Θεοῦ ἡμῶν, ἐν οἷς ἐπισκέψεται ἡμᾶς ἀνατολὴ ἐξ ὕψους",
            "79": "ἐπιφάναι τοῖς ἐν σκότει καὶ σκιᾷ θανάτου καθημένοις, τοῦ κατευθῦναι τοὺς πόδας ἡμῶν εἰς ὁδὸν εἰρήνης.",
            "80": "Τὸ δὲ παιδίον ηὔξανεν καὶ ἐκραταιοῦτο πνεύματι, καὶ ἦν ἐν ταῖς ἐρήμοις ἕως ἡμέρας ἀναδείξεως αὐτοῦ πρὸς τὸν Ἰσραήλ.",
        },
        "10": {
            "1": "1μετα δε ταυτα ανεδειξεν ο κυριος και ετερους εβδομηκοντα και απεστειλεν αυτους ανα δυο προ προσωπου αυτου εις πασαν πολιν και τοπον ου εμελλεν αυτος ερχεσθαι",
            "2": "ελεγεν ουν προς αυτους ο μεν θερισμος πολυς οι δε εργαται ολιγοι δεηθητε ουν του κυριου του θερισμου οπως εκβαλλη εργατας εις τον θερισμον αυτου",
            "3": "υπαγετε ιδου εγω αποστελλω υμας ως αρνας εν μεσω λυκων",
            "4": "μη βασταζετε βαλαντιον μη πηραν μηδε υποδηματα και μηδενα κατα την οδον ασπασησθε",
            "5": "εις ην δ αν οικιαν εισερχησθε πρωτον λεγετε ειρηνη τω οικω τουτω",
            "6": "και εαν μεν η εκει υιος ειρηνης επαναπαυσεται επ αυτον η ειρηνη υμων ει δε μηγε εφ υμας ανακαμψει",
            "7": "εν αυτη δε τη οικια μενετε εσθιοντες και πινοντες τα παρ αυτων αξιος γαρ ο εργατης του μισθου αυτου εστιν μη μεταβαινετε εξ οικιας εις οικιαν",
            "8": "και εις ην δ αν πολιν εισερχησθε και δεχωνται υμας εσθιετε τα παρατιθεμενα υμιν",
            "9": "και θεραπευετε τους εν αυτη ασθενεις και λεγετε αυτοις ηγγικεν εφ υμας η βασιλεια του θεου",
            "10": "εις ην δ αν πολιν εισερχησθε και μη δεχωνται υμας εξελθοντες εις τας πλατειας αυτης ειπατε",
            "11": "και τον κονιορτον τον κολληθεντα ημιν εκ της πολεως υμων απομασσομεθα υμιν πλην τουτο γινωσκετε οτι ηγγικεν εφ υμας η βασιλεια του θεου",
            "12": "λεγω δε υμιν οτι σοδομοις εν τη ημερα εκεινη ανεκτοτερον εσται η τη πολει εκεινη",
            "13": "ουαι σοι χωραζιν ουαι σοι βηθσαιδα οτι ει εν τυρω και σιδωνι εγενοντο αι δυναμεις αι γενομεναι εν υμιν παλαι αν εν σακκω και σποδω καθημεναι μετενοησαν",
            "14": "πλην τυρω και σιδωνι ανεκτοτερον εσται εν τη κρισει η υμιν",
            "15": "και συ καπερναουμ η εως του ουρανου υψωθεισα εως αδου καταβιβασθηση",
            "16": "ο ακουων υμων εμου ακουει και ο αθετων υμας εμε αθετει ο δε εμε αθετων αθετει τον αποστειλαντα με",
            "17": "υπεστρεψαν δε οι εβδομηκοντα μετα χαρας λεγοντες κυριε και τα δαιμονια υποτασσ εται ημιν εν τω ονοματι σου",
            "18": "ειπεν δε αυτοις εθεωρουν τον σαταναν ως αστραπην εκ του ουρανου πεσοντα",
            "19": "ιδου διδωμι υμιν την εξουσιαν του πατειν επανω οφεων και σκορπιων και επι πασαν την δυναμιν του εχθρου και ουδεν υμας ου μη αδικηση va",
            "20": "πλην εν τουτω μη χαιρετε οτι τα πνευματα υμιν υποτασσεται χαιρετε δε μαλλον οτι τα ονοματα υμων εγραφη εν τοις ουρανοις",
            "21": "εν αυτη τη ωρα ηγαλλιασατο τω πνευματι ο ιησους και ειπεν εξομολογουμαι σοι πατερ κυριε του ουρανου και της γης οτι απεκρυψας ταυτα απο σοφων και συνετων και απεκαλυψας αυτα νηπιοις ναι ο πατηρ οτι ουτως εγενετο ευδοκια εμπροσθεν σου",
            "22": "και στραφεις προς τους μαθητας ειπεν παντα παρεδοθη μοι υπο του πατρος μου και ουδεις γινωσκει τις εστιν ο υιος ει μη ο πατηρ και τις εστιν ο πατηρ ει μη ο υιος και ω εαν βουληται ο υιος αποκαλυψαι",
            "23": "και στραφεις προς τους μαθητας κατ ιδιαν ειπεν μακαριοι οι οφθαλμοι οι βλεποντες α βλεπετε",
            "24": "λεγω γαρ υμιν οτι πολλοι προφηται και βασιλεις ηθελησαν ιδειν α υμεις βλεπετε και ουκ ειδον και ακουσαι α ακουετε και ουκ ηκουσαν",
            "25": "και ιδου νομικος τις ανεστη εκπειραζων αυτον και λεγων διδασκαλε τι ποιησας ζωην αιωνιον κληρονομησω",
            "26": "ο δε ειπεν προς αυτον εν τω νομω τι γεγραπται πως αναγινωσκεις",
            "27": "ο δε αποκριθεις ειπεν αγαπησεις κυριον τον θεον σου εξ ολης της καρδιας σου και εξ ολης της ψυχης σου και εξ ολης της ισχυος σου και εξ ολης της διανοιας σου και τον πλησιον σου ως σεαυτον",
            "28": "ειπεν δε αυτω ορθως απεκριθης τουτο ποιει και ζηση",
            "29": "ο δε θελων δικαιουν εαυτον ειπεν προς τον ιησουν και τις εστιν μου πλησιον",
            "30": "υπολαβων δε ο ιησους ειπεν ανθρωπος τις κατεβαινεν απο ιερουσαλημ εις ιεριχω και λησταις περιεπεσεν οι και εκδυσαντες αυτον και πληγας επιθεντες απηλθον αφεντες ημιθανη τυγχανοντα",
            "31": "κατα συγκυριαν δε ιερευς τις κατεβαινεν εν τη οδω εκεινη και ιδων αυτον αντιπαρηλθεν",
            "32": "ομοιως δε και λευιτης γενομενος κατα τον τοπον ελθων και ιδων αντιπαρηλθεν",
            "33": "σαμαρειτης δε τις οδευων ηλθεν κατ αυτον και ιδων αυτον εσπλαγχνισθη",
            "34": "και προσελθων κατεδησεν τα τραυματα αυτου επιχεων ελαιον και οινον επιβιβασας δε αυτον επι το ιδιον κτηνος ηγαγεν αυτον εις πανδοχειον και επεμεληθη αυτου",
            "35": "και επι την αυριον εξελθων εκβαλων δυο δηναρια εδωκεν τω πανδοχει και ειπεν αυτω επιμεληθητι αυτου και ο τι αν προσδαπανησης εγω εν τω επανερχεσθαι με αποδωσω σοι",
            "36": "τις ουν τουτων των τριων δοκει σοι πλησιον γεγονεναι του εμπεσοντος εις τους ληστας",
            "37": "ο δε ειπεν ο ποιησας το ελεος μετ αυτου ειπεν ουν αυτω ο ιησους πορευου και συ ποιει ομοιως",
            "38": "εγενετο δε εν τω πορευεσθαι αυτους και αυτος εισηλθεν εις κωμην τινα γυνη δε τις ονοματι μαρθα υπεδεξατο αυτον εις τον οικον αυτης",
            "39": "και τηδε ην αδελφη καλουμενη μαρια η και παρακαθισασα παρα τους ποδας του ιησου ηκουεν τον λογον αυτου",
            "40": "η δε μαρθα περιεσπατο περι πολλην διακονιαν επιστασα δε ειπεν κυριε ου μελει σοι οτι η αδελφη μου μονην με κατελιπεν διακονειν ειπε ουν αυτη ινα μοι συναντιλαβηται",
            "41": "αποκριθεις δε ειπεν αυτη ο ιησους μαρθα μαρθα μεριμνας και τυρβαζη περι πολλα",
            "42": "ενος δε εστιν χρεια μαρια δε την αγαθην μεριδα εξελεξατο ητις ουκ αφαιρεθησεται απ αυτης"
        },    "20":
        {
            "1": "και εγενετο εν μια των ημερων εκεινων διδασκοντος αυτου τον λαον εν τω ιερω και ευαγγελιζομενου επεστησαν οι αρχιερεις και οι γραμματεις συν τοις πρεσβυτεροις",
            "2": "και ειπον προς αυτον λεγοντες ειπε ημιν εν ποια εξουσια ταυτα ποιεις η τις εστιν ο δους σοι την εξουσιαν ταυτην",
            "3": "αποκριθεις δε ειπεν προς αυτους ερωτησω υμας καγω ενα λογον και ειπατε μοι",
            "4": "το βαπτισμα ιωαννου εξ ουρανου ην η εξ ανθρωπων",
            "5": "οι δε συνελογισαντο προς εαυτους λεγοντες οτι εαν ειπωμεν εξ ουρανου ερει δια τι ουν ουκ επιστευσατε αυτω",
            "6": "εαν δε ειπωμεν εξ ανθρωπων πας ο λαος καταλιθασει ημας πεπεισμενος γαρ εστιν ιωαννην προφητην ειναι",
            "7": "και απεκριθησαν μη ειδεναι ποθεν",
            "8": "και ο ιησους ειπεν αυτοις ουδε εγω λεγω υμιν εν ποια εξουσια ταυτα ποιω",
            "9": "ηρξατο δε προς τον λαον λεγειν την παραβολην ταυτην ανθρωπος τις εφυτευσεν αμπελωνα και εξεδοτο αυτον γεωργοις και απεδημησεν χρονους ικανους",
            "10": "και εν καιρω απεστειλεν προς τους γεωργους δουλον ινα απο του καρπου του αμπελωνος δωσιν αυτω οι δε γεωργοι δειραντες αυτον εξαπεστειλαν κενον",
            "11": "και προσεθετο πεμψαι ετερον δουλον οι δε κακεινον δειραντες και ατιμασαντες εξαπεστειλαν κενον",
            "12": "και προσεθετο πεμψαι τριτον οι δε και τουτον τραυματισαντες εξεβαλον",
            "13": "ειπεν δε ο κυριος του αμπελωνος τι ποιησω πεμψω τον υιον μου τον αγαπητον ισως τουτον ιδοντες εντραπησονται",
            "14": "ιδοντες δε αυτον οι γεωργοι διελογιζοντο προς εαυτους λεγοντες ουτος εστιν ο κληρονομος δευτε αποκτεινωμεν αυτον ινα ημων γενηται η κληρονομια",
            "15": "και εκβαλοντες αυτον εξω του αμπελωνος απεκτειναν τι ουν ποιησει αυτοις ο κυριος του αμπελωνος",
            "16": "ελευσεται και απολεσει τους γεωργους τουτους και δωσει τον αμπελωνα αλλοις ακουσαντες δε ειπον μη γενοιτο",
            "17": "ο δε εμβλεψας αυτοις ειπεν τι ουν εστιν το γεγραμμενον τουτο λιθον ον απεδοκιμασαν οι οικοδο μουντες ουτος εγενηθη εις κεφαλην γωνιας",
            "18": "πας ο πεσων επ εκεινον τον λιθον συνθλασθησεται εφ ον δ αν πεση λικμησει αυτον",
            "19": "και εζητησαν οι αρχιερεις και οι γραμματεις επιβαλειν επ αυτον τας χειρας εν αυτη τη ωρα και εφοβηθησαν τον λαον εγνωσαν γαρ οτι προς αυτους την παραβολην ταυτην ειπεν",
            "20": "και παρατηρησαντες απεστειλαν εγκαθετους υποκρινομενους εαυτους δικαιους ειναι ινα επιλαβωνται αυτου λογου εις το παραδουναι αυτον τη αρχη και τη εξουσια του ηγεμονος",
            "21": "και επηρωτησαν αυτον λεγοντες διδασκαλε οιδαμεν οτι ορθως λεγεις και διδασκεις και ου λαμβανεις προσωπον αλλ επ αληθειας την οδον του θεου διδασκεις",
            "22": "εξεστιν ημιν καισαρι φορον δουναι η ου",
            "23": "κατανοησας δε αυτων την πανουργιαν ειπεν προς αυτους τι με πειραζετε",
            "24": "επιδειξατε μοι δηναριον τινος εχει εικονα και επιγραφην αποκριθεντες δε ειπον καισαρος",
            "25": "ο δε ειπεν αυτοις αποδοτε τοινυν τα καισαρος καισαρι και τα του θεου τω θεω",
            "26": "και ουκ ισχυσαν επιλαβεσθαι αυτου ρηματος εναντιον του λαου και θαυμασαντες επι τη αποκρισει αυτου εσιγησαν",
            "27": "προσελθοντες δε τινες των σαδδουκαιων οι αντιλεγοντες αναστασιν μη ειναι επηρωτησαν αυτον",
            "28": "λεγοντες διδασκαλε μωσης εγραψεν ημιν εαν τινος αδελφος αποθανη εχων γυναικα και ουτος ατεκνος αποθανη ινα λαβη ο αδελφος αυτου την γυναικα και εξαναστηση σπερμα τω αδελφω αυτου",
            "29": "επτα ουν αδελφοι ησαν και ο πρωτος λαβων γυναικα απεθανεν ατεκνος",
            "30": "και ελαβεν ο δευτερος την γυναικα και ουτος απεθανεν ατεκνος",
            "31": "και ο τριτος ελαβεν αυτην ωσαυτως δε και οι επτα ου κατελιπον τεκνα και απεθανον",
            "32": "υστερον δε παντων απεθανεν και η γυνη",
            "33": "εν τη ουν αναστασει τινος αυτων γινεται γυνη οι γαρ επτα εσχον αυτην γυναικα",
            "34": "και αποκριθεις ειπεν αυτοις ο ιησους οι υιοι του αιωνος τουτου γαμουσιν και εκγαμισκονται",
            "35": "οι δε καταξιωθεντες του αιωνος εκεινου τυχειν και της αναστα σεως της εκ νεκρων ουτε γαμουσιν ουτε εκγαμισκονται",
            "36": "ουτε γαρ αποθανειν ετι δυνανται ισαγγελοι γαρ εισιν και υιοι εισιν του θεου της αναστασεως υιοι οντες",
            "37": "οτι δε εγειρονται οι νεκροι και μωσης εμηνυσεν επι της βατου ως λεγει κυριον τον θεον αβρααμ και τον θεον ισαακ και τον θεον ιακωβ",
            "38": "θεος δε ουκ εστιν νεκρων αλλα ζωντων παντες γαρ αυτω ζωσιν",
            "39": "αποκριθεντες δε τινες των γραμματεων ειπον διδασκαλε καλως ειπας",
            "40": "ουκετι δε ετολμων επερωταν αυτον ουδεν",
            "41": "ειπεν δε προς αυτους πως λεγουσιν τον χριστον υιον δαβιδ ειναι",
            "42": "και αυτος δαβιδ λεγει εν βιβλω ψαλμων ειπεν ο κυριος τω κυριω μου καθου εκ δεξιων μου",
            "43": "εως αν θω τους εχθρους σου υποποδιον των ποδων σου",
            "44": "δαβιδ ουν κυριον αυτον καλει και πως υιος αυτου εστιν",
            "45": "ακουοντος δε παντος του λαου ειπεν τοις μαθηταις αυτου",
            "46": "προσεχετε απο των γραμματεων των θελοντων περιπατειν εν στολαις και φιλουντων ασπασμους εν ταις αγοραις και πρωτοκαθεδριας εν ταις συναγωγαις και πρωτοκλισιας εν τοις δειπνοις",
            "47": "οι κατεσθιουσιν τας οικιας των χηρων και προφασει μακρα προσευχονται ουτοι ληψονται περισσοτερον κριμα"
        }
    }
    claremont_rule = pd.read_csv("data/claremont_readings.csv")
    evaluations_readings = []
    evaluations_silhouettes = []
    for manuscript_name, content in manuscripts.items():
        evaluations_readings.append(
            evaluate_manuscript_readings(content, rule=claremont_rule))
        evaluations_silhouettes.append(
            evaluate_manuscript_silhouette(content, rule=claremont_rule))

    profiles = pd.concat(evaluations_silhouettes, axis=1)
    profiles.columns = manuscripts.keys()
    profiles.to_csv("data/profiles.csv")
    logger.info("Generated new manuscript profile")

    readings = pd.concat(evaluations_readings, axis=1)
    readings.columns = manuscripts.keys()
    readings.to_csv("data/readings.csv")
    logger.info("Generated new manuscript readings")
