"""Get the claremont profile readings.
"""
import pandas as pd
import re
from loguru import logger


raw_text = """
* Luke 1:2 (1 reading) — παρεδοσαν ] '''παρεδωκαν'''
* Luke 1:7 (2 reading) — '''ην η ελισαβετ''' ] η ελισαβετ ην
* Luke 1:7 (3 reading) — η ] '''omit η'''
* Luke 1:8 (4 reading) — εναντι ] '''εναντιον'''
* Luke 1:9 (5 reading) — κυριου ] '''θεου'''
* Luke 1:10 (6 reading) — '''ην του λαου''' ] του λαου ην
* Luke 1:14 (7 reading) — επι ] '''εν'''
* Luke 1:14 (8 reading) — '''γενεσει''' ] γεννεσει
* Luke 1:15 (9 reading) — του ] '''omit του'''
* Luke 1:15 (10 reading) — κυριου ] '''θεου'''
* Luke 1:16 (11 reading) — επι ] '''προς'''
* Luke 1:17 (12 reading) — ετοιμασαι ] + '''τω'''
* Luke 1:21 (13 reading) — εθαυμαζον ] '''εθαυμαζεν'''
* Luke 1:22 (14 reading) — '''εδυνατο''' ] ηδυνατο
* Luke 1:22 (15 reading) — αυτοις ] '''omit αυτοις'''
* Luke 1:22 (16 reading) — διεμενε(ν) ] '''διεμεινε'''
* Luke 1:23 (17 reading) — επλησθησαν ] '''επληρωθησαν'''
* Luke 1:24 (18 reading) — ταυτας τας ημερας ] '''τας ημερας ταυτας'''
* Luke 1:25 (19 reading) — επειδεν ] '''εφειδεν'''
* Luke 1:26 (20 reading) — '''απο''' ] υπο
* Luke 1:26 (21 reading) — του ] '''omit του'''
* Luke 1:26 (22 reading) — '''Ναζαρεθ''' ] Ναζαρετ
* Luke 1:27 (23 reading) — οικου ] '''οικου και πατριας'''
* Luke 1:29 (24 reading) — '''δε''' ] '''δε ιδουσα'''
* Luke 1:29 (25 reading) — '''επι τω λογω διεταραχθη''' ] διεταραχθη επι τω λογω
* Luke 1:29 (26 reading) — '''τω λογω''' ] τω λογω αυτου
* Luke 1:30 (27 reading) — ο αγγελος αυτη ] '''αυτη ο αγγελος'''
* Luke 1:34 (28 reading) — εσται ] '''εσται μοι'''
* Luke 1:35 (29 reading) — γεννωμενον ] '''γεννωμενον εκ σου'''
* Luke 1:39 (30 reading) — αναστασα δε ] '''και αναστασα'''
* Luke 1:39 (31 reading) — δε ] '''omit δε'''
* Luke 1:41 (32 reading) — '''τον ασπασμον της μαριας η ελισαβετ''' ] η ελισαβετ τον ασπασμον της μαριας
* Luke 1:42 (33 reading) — ανεφωνησεν ] '''ανεβοησεν'''
* Luke 1:42 (33 reading) — ανεφωνησε ] '''ανεβοησε'''
* Luke 1:44 (34 reading) — εν αγαλλιασει το βρεφος ] '''το βρεφος εν αγαλλιασει'''
* Luke 1:45 (35 reading) — εσται ] '''εσται η'''
* Luke 1:50 (36 reading) — γενεας και γενεας ] '''γενεαν και γενεαν''' TR reads: γενεας γενεων
* Luke 1:55 (37 reading) — εις τον αιωνα ] '''εως αιωνος'''
* Luke 1:57 (38 reading) — τη ] '''της'''
* Luke 1:59 (39 reading) — '''ημερα τη ογδοη''' ] ογδοη ημερα
* Luke 1:61 (40 reading) — οτι ] '''omit οτι'''
* Luke 1:61 (41 reading) — '''εκ της συγγενειας''' ] εν τη συγγενεια
* Luke 1:62 (42 reading) — '''αυτο''' ] αυτον
* Luke 1:63 (43 reading) — εστιν ] '''εσται'''
* Luke 1:63 (43 reading) — εστι ] '''εσται'''
* Luke 1:65 (44 reading) — και εγενετο ] '''εγενετο δε'''
* Luke 1:65 (45 reading) — παντα ] '''omit'''
* Luke 1:66 (46 reading) — αυτου ] '''αυτων'''
* Luke 1:67 (47 reading) — '''επροφητευσε''' ] προφητευσε
* Luke 1:67 (47 reading) — '''επροφητευσεν''' ] προφητευσε
* Luke 1:69 (48 reading) — '''εν''' ] εν τω
* Luke 1:70 (49 reading) — '''αγιων''' ] αγιων των
* Luke 1:74 (50 reading) — '''χειρος''' ] χειρος των
* Luke 1:74 (51 reading) — '''εχθρων''' ] εχθρων ηνων
* Luke 1:75 (52 reading) — '''ημεραις''' ] ημεραις της ζωης
* Luke 1:77 (53 reading) — αυτων ] '''ημων'''
* Luke 1:80 (54 reading) — ισραηλ ] '''λαον'''
* Luke 10:1 (1 reading) — '''δυο δυο''' ] δυο
* Luke 10:1 (2 reading) — αυτου ] '''εαυτου'''
* Luke 10:1 (3 reading) — '''ημελλεν''' ] εμελλεν
* Luke 10:1 (4 reading) — ερχεσθαι ] '''διερχεσθαι'''
* Luke 10:1 (5 reading) — &nbsp; &nbsp; &nbsp; ] '''εισερχεσθαι'''
* Luke 10:2 (6 reading) — ελεγεν ] '''ειπεν'''
* Luke 10:2 (7 reading) — δε ] ουν
* Luke 10:2 (8 reading) — οπως ] '''οπως αν'''
* Luke 10:3 (9 reading) — αρνας ] '''προβατα'''
* Luke 10:4 (10 reading) — μη ] '''μητε'''
* Luke 10:4 (11 reading) — '''μη''' ] μηδε
* Luke 10:4 (12 reading) —     ] '''μητε'''
* Luke 10:5 (13 reading) — '''εισελθητε''' ] εισερχησθε
* Luke 10:5 (14 reading) — ειρηνη ] '''ειρηνη εν'''
* Luke 10:6 (15 reading) — '''εαν''' ] εαν μεν
* Luke 10:6 (16 reading) — εφ ] '''προς'''
* Luke 10:7 (17 reading) — οικιας ] '''οικιαν'''
* Luke 10:8 (18 reading) — '''ην''' ] ην δ'
* Luke 10:8 (19 reading) — εισερχησθε ] '''εισερχεσθε'''
* Luke 10:10 (20 reading) — '''εισελθητε''' ] '''εισερχησθε'''
* Luke 10:11 (21 reading) — ημιν ] '''υμιν'''
* Luke 10:11 (22 reading) — '''εις τους ποδας''' ] '''omit'''
* Luke 10:12 (23 reading) — '''λεγω''' ] λεγω δε
* Luke 10:12 (24 reading) — εν τη ημερα εκεινη ανεκτοτερον εσται ] '''ανεκτοτερον εσται εν τη ημερα εκεινη'''
* Luke 10:13 (25 reading) — Βηθσαιδα ] '''Βηθσαιδαν'''
* Luke 10:13 (26 reading) — '''εγενηθησαν''' ] εγενοντο
* Luke 10:14 (27 reading) — ανεκτοτερον εσται εν τη κρισει ] '''εν τη κρισει ανεκτοτερον εσται'''
* Luke 10:14 (28 reading) — εν τη κρισει ] '''ημερα κρισεως'''
* Luke 10:14 (28 reading) — εν τη κρισει ] '''εν ημερα κρισεως'''
* Luke 10:15 (29 reading) — '''υψωθειση''' ] υψωθεισα
* Luke 10:16 (30 reading) — ακουων υμων ] '''υμων ακουων'''
* Luke 10:16 (31 reading) — με ] '''με και ο ακουων εμου ακουει του αποστειλαντος με'''
* Luke 10:17 (32 reading) — οι εβδομηκοντα μετα χαρας ] '''μετα χαρας οι εβδομηκοντα'''
* Luke 10:17 (33 reading) — εβδομηκοντα ] '''εβδομηκοντα μαθηται'''
* Luke 10:17 (34 reading) — υποτασσεται ημιν ] '''ημιν υποτασσεται'''
* Luke 10:21 (35 reading) — αυτη ] '''αυτη δε'''
* Luke 10:21 (36 reading) — τω πνευματι τω αγιω ] '''ο Ιησους τω πνευματι'''
* Luke 10:22 (37 reading) — '''παντα''' ] και στραφεις προς τους μαθητας ειπε παντα
* Luke 10:22 (38 reading) — παρεδοθε ] '''παρα δεδοται'''
* Luke 10:22 (39 reading) — τις εστιν ο υιος ει μη ο πατηρ ] '''omit'''
* Luke 10:23 (40 reading) — ειπε(ν) ] '''ειπεν αυτοις'''
* Luke 10:24 (41 reading) — γαρ ] '''δε'''
* Luke 10:26 (42 reading) — δε ] '''δε Ιησους'''
* Luke 10:28 (43 reading) — αυτω ] '''αυτω Ιησους'''
* Luke 10:30 (44 reading) — εκδυσαντες ] '''εξεδυσαν'''
* Luke 10:30 (45 reading) — '''ημιθανη''' ] ημιθανη τυγχανοντα
* Luke 10:32 (46 reading) — γενομενος ] '''omit γενομενος'''
* Luke 10:32 (47 reading) — ελθων ] '''omit ελθων'''
* Luke 10:32 (48 reading) — ιδων ] '''ιδων αυτον'''
* Luke 10:33 (49 reading) — '''ιδων''' ] ιδων αυτον
* Luke 10:34 (50 reading) — αυτον ] '''omit αυτον'''
* Luke 10:35 (51 reading) — '''αυριον''' ] αυριον εξελθον
* Luke 10:35 (52 reading) — '''ειπεν''' ] ειπεν αυτω
* Luke 10:35 (53 reading) — τι ] '''τι δ''''
* Luke 10:35 (54 reading) — εγω ] '''omit εγω'''
* Luke 10:35 (55 reading) — με ] '''μοι'''
* Luke 10:36 (56 reading) — '''τις''' ] τις ουν
* Luke 10:36 (57 reading) — '''πλησιον δοκει σοι''' ] δοκει σοι πλησιον
* Luke 10:37 (58 reading) — '''δε''' ] ουν
* Luke 10:38 (59 reading) — αυτους ] '''αυτον'''
* Luke 10:39 (60 reading) — τον λογον ] '''των λογων'''
* Luke 10:39 (61 reading) —     ] '''τους λογους'''
* Luke 10:40 (62 reading) — μελει ] '''μελλει'''
* Luke 10:41 (63 reading) — ειπεν αυτη ο κυριος (or Ιησους) ] '''ο κυριος ειπεν αυτη'''
* Luke 10:42 (64 reading) — '''γαρ''' ] δε
* Luke 20:1 (1 reading) — '''ημερων''' ] ημερων εκεινων
* Luke 20:1 (2 reading) — εν τω ιερω ] '''omit εν τω ιερω'''
* Luke 20:1 (3 reading) — αρχιερεις και οι γραμματεις ] '''γραμματεις και οι αρχιερεις'''
* Luke 20:1 (4 reading) — αρχιερεις ] '''ιερεις'''
* Luke 20:2 (5 reading) — και ειπαν ] '''οmit και ειπαν'''
* Luke 20:2 (6 reading) — '''λεγοντες προς αυτον''' ] προς αυτον λεγοντες
* Luke 20:2 (7 reading) — '''ειπον''' ] ειπε
* Luke 20:3 (8 reading) — υμας καγω ] '''καγω υμας'''
* Luke 20:3 (9 reading) — ενα λογον ] '''λογον ενα'''
* Luke 20:3 (10 reading) — ενα ] '''omit''' 
* Luke 20:5 (11 reading) — συνελογισαντο ] '''διελογισαντο'''
* Luke 20:5 (12 reading) — οτι ] '''omit οτι'''
* Luke 20:5 (13 reading) — '''δια τι''' ] δια τι ουν
* Luke 20:6 (14 reading) — '''ο λαος απας''' ] πας ο λαος
* Luke 20:6 (15 reading) — ειναι ] '''γεγονεναι'''
* Luke 20:7 (16 reading) — ειδεναι ] '''ειδεναι το'''
* Luke 20:7 (17 reading) — ποθεν ] '''omit'''
* Luke 20:8 (18 reading) — και ο ] '''ο δε'''
* Luke 20:9 (19 reading) — τις ] '''omit'''
* Luke 20:10 (20 reading) — και ] '''και τω'''
* Luke 20:10 (21 reading) — και εν ] '''εν τω''' (TR reads: και εν)
* Luke 20:10 (21 reading) —  ] '''εν τω'''
* Luke 20:10 (22 reading) — απο του καρπου του αμπελωνος δωσουσιν αυτω ] '''λαβε απο του καρπου του αμπελωνος'''
* Luke 20:10 (23 reading) — εξαπεστειλαν ] '''απεστειλαν'''
* Luke 20:12 (24 reading) — και τουτον ] '''κακεινον'''
* Luke 20:13 (25 reading) — '''τουτον''' ] '''τουτον ιδοντες'''
* Luke 20:14 (26 reading) — διελογιζοντο ] '''διελογισαντο'''
* Luke 20:14 (27 reading) — '''αλληλους''' ] εαυτους
* Luke 20:14 (28 reading) — '''κληρονομος''' ] κληρονομος δευτε
* Luke 20:14 (29 reading) — ινα ημων γενηται ] '''και ημων εστι'''
* Luke 20:14 (29 reading) — ινα ημων εσται ] '''και ημων εσται'''
* Luke 20:15 (30 reading) — αυτον ] '''οmit αυτον'''
* Luke 20:16 (31 reading) — τουτος ] '''εκεινους'''
* Luke 20:18 (32 reading) — επ ] '''εις'''
* Luke 20:19 (33 reading) — '''γραμματεις και οι αρχιερεις''' ] αρχιερεις και οι γραμματεις
* Luke 20:19 (34 reading) — τας χειρας ] '''την χειρα'''
* Luke 20:19 (35 reading) — τον λαον ] '''omit'''
* Luke 20:19 (36 reading) — τον λαον ] '''οχλον'''
* Luke 20:19 (37 reading) — '''ειπεν την παραβολην ταυτην''' ] την παραβολην ταυτην ειπεν
* Luke 20:19 (37 reading) — '''ειπε την παραβολην ταυτην''' ] την παραβολην ταυτην ειπε
* Luke 20:22 (38 reading) — '''ημας''' ] ημιν
* Luke 20:22 (39 reading) — φορον ] '''φορους'''
* Luke 20:22 (40 reading) — δουναι ] '''διδονται'''
* Luke 20:23 (41 reading) — '''αυτους''' ] αυτους τι μη πειραζετε
* Luke 20:24 (42 reading) — '''δειξατε''' ] επιδειξατε
* Luke 20:24 (43 reading) — δηναριον ] '''δηναριον οι δε εδειξαν και ειπε'''
* Luke 20:25 (44 reading) — δε ] '''omit δε'''
* Luke 20:25 (45 reading) — '''προς αυτους''' ] αυτοις
* Luke 20:25 (46 reading) — '''τοινυν αποδοτε''' ] αποδοτε τοινυν
* Luke 20:25 (47 reading) — Καισαρος ] '''Καισαρος τω'''
* Luke 20:27 (48 reading) — αντιλεγοντες ] '''λεγοντες'''
* Luke 20:27 (49 reading) — επηρωτεσαν ] '''επηρωτουν'''
* Luke 20:28 (50 reading) — '''Μωυσης''' ] Μωσης
* Luke 20:28 (51 reading) — '''η''' ] αποθανη
* Luke 20:28 (52 reading) — λαβη ο αδελφος αυτου ] ο αδελφος αυτου  λαβη
* Luke 20:29 (53 reading) — ησαν ] '''ησαν παρ ημιν'''
* Luke 20:31 (54 reading) — ωσαυτως ] '''ωσαυτως ως αυτως'''
* Luke 20:31 (55 reading) — '''επτα''' ] επτα και
* Luke 20:31 (56 reading) — και απεθανον ] '''omit και απεθανον'''
* Luke 20:32 (57 reading) — υστερον ] '''υστερον παντων'''
* Luke 20:32 (58 reading) — υστερον δε παντων ] + '''δε'''
* Luke 20:33 (59 reading) — ουν εν τη αναστασει ] '''εν τη αναστασει ουν'''
* Luke 20:33 (60 reading) — γινεται ] '''εσται'''
* Luke 20:34 (61 reading) — γαμισκονται ] '''εκγαμιζονται'''
* Luke 20:35 (62 reading) — γαμιζονται ] '''εκγαμιζονται'''
* Luke 20:36 (63 reading) — ετι ] '''omit ετι'''
* Luke 20:36 (64 reading) — εισιν ] '''omit εισι'''
* Luke 20:36 (64 reading) — εισι ] '''omit εισιν'''
* Luke 20:37 (65 reading) — '''Μωυσης''' ] Μωσης
* Luke 20:37 (66 reading) — εμηνυσεν ] '''εμνημονευσεν'''
* Luke 20:39 (67 reading) — ειπας ] '''λεγεις'''
* Luke 20:40 (68 reading) — επερωταν ] '''επερωτησαι'''
* Luke 20:40 (69 reading) — ουδεν ] '''ουδε εν'''
* Luke 20:41 (70 reading) — λεγουσι ] '''λεγουσι τινες'''
* Luke 20:41 (70 reading) — λεγουσιν ] '''λεγουσι τινες'''
* Luke 20:41 (71 reading) — και Χριστον ειναι Δαυιδ υιον ] '''οι γραμματεις οτι ο Χριστος υιος δαυιδ εστιν'''
* Luke 20:42 (72 reading) — '''αυτος γαρ''' ] και αυτος
* Luke 20:42 (73 reading) — βιβλω ] '''βιβλω των'''
* Luke 20:44 (74 reading) — κυριον αυτον ] '''αυτον κυριον'''
* Luke 20:44 (75 reading) — '''αυτου υιος''' ] υιος αυτου
* Luke 20:46 (76 reading) — περιπατειν εν στολαις ] '''εν στολαις περιπατειν'''
* Luke 20:47 (77 reading) — κατεσθιουσι ] '''κατεσθιοντες'''
* Luke 20:47 (78 reading) — προσευχονται ] '''προσευχομενοι'''
"""

def get_claremont_reading_rule(raw_text):
    """Get the readings that should be evaluated for the Claremont evaluation, given the raw text.
    """

    claremont_evaluation = []
    
    to_parse = raw_text.replace("Luke", "")
    for line in raw_text.split("\n"):
        if line:
            match = re.search(r"(\d+):(\d+)", line)
            if match:
                chapter = match.group(1)
                verse = match.group(2)
            match = re.search(r'\((\d+) reading\)', line)
            if match:
                reading_id = match.group(1)
            match = re.search(r"'''(.*?)'''", line)
            if match:
                reading = match.group(1)
            # Capture alternative reading
            split_line = line.split("—")[1]
            alternative_reading = split_line.replace(f"'''{reading}'''", "").replace("]", "").replace("[", "").strip()
            claremont_evaluation.append({"chapter": chapter,
                   "verse": verse,
                   "reading_id": reading_id,
                   "reading": reading,
                    "alternative_reading": alternative_reading})
    return pd.DataFrame(claremont_evaluation)


if __name__ == "__main__":

    claremont_rule = get_claremont_reading_rule(raw_text)

    claremont_rule.to_csv("data/claremont_readings.csv")

    logger.info("Generated new rule")